var LBImgData = [
    {
        "img":"img/lb (1).jpg",
        "link":"###",
        "text":"CSS3已经变得非常流行，原本的CSS不支持自定义字体"
    },
    {
        "img":"img/lb (2).jpg",
        "link":"###",
        "text":"CSS2已经变得非常流行，原本的CSS不支持自定义字体"
    },
    {
        "img":"img/lb (3).jpg",
        "link":"###",
        "text":"CSS3，原本的CSS不支持自定义字体"
    },
    {
        "img":"img/lb (4).jpg",
        "link":"###",
        "text":"CSS3已经变得支持自定义字体"
    },
    {
        "img":"img/lb (5).jpg",
        "link":"###",
        "text":"得非常流行，原本的CSS不支持自定义字体"
    }
];//图片展示

var HotData = [
    {
        "title":"良好的代码风格养成记",
        "detail":"综述 优秀的代码风格如同一身得体的打扮，能够给人以良好的印象。初学程序设计，首先必须建立良好的编程习惯，这其中就包括代码风格。本文就代码风格中的几个重点问题进行了讨论，并在文后给出了一份优秀的代码作为风格模板。代码风格不必花费太多专门的时间研究，在使用中不断模仿模板代码，轻轻松松...",
        "link":"###"
    },
    {
        "title":"JavaScript 之闭包与高阶函数",
        "detail":"闭包，常指有权访问其外部作用域中变量和参数的函数。最常见的就是在某函数内部创建另一个函数。闭包中所保存的是整个变量对象–执行环境（上下文环境）中的一个表示变量的对象的引用，访问执行环境中变量即是访问该变量对象中的变量。",
        "link":"###"
    },
    {
        "title":"使用CSS3自定义网页字体的方法",
        "detail":"CSS3已经变得非常流行，原本的CSS不支持自定义字体，但是传说中的CSS3基本上什么都可以，那么CSS3中可不可以自定义英文字体呢？这里我们就一起来感受一下。",
        "link":"###"
    }
]

var arrImgDetail = ['img/jquery.jpg','img/qq_guanjia.jpg','img/guomei-mobile.jpg','img/jike.jpg'];//图片展示

// var LConData1 = ["推荐阅读",
//     [
//         {
//             "title":"JavaScript与jQuery基本用法总结",
//             "date":"2016-2-18",
//             "link":"###",
//             "img":"img/demo.jpg"
//         },
//         {
//             "title":"333333333333",
//             "date":"2016-2-18",
//             "link":"###",
//             "img":"img/demo.jpg"
//         },
//         {
//             "title":"JavaScript与jQuery基本用法总结",
//             "date":"2016-2-18",
//             "link":"###",
//             "img":"img/demo.jpg"
//         },
//         {
//             "title":"JavaScript与jQuery基本用法总结",
//             "date":"2016-2-18",
//             "link":"###",
//             "img":"img/demo.jpg"
//         },
//         {
//             "title":"JavaScript与jQuery基本用法总结",
//             "date":"2016-2-18",
//             "link":"###",
//             "img":"img/demo.jpg"
//         }
//     ]
// ]

/*var data = [
    {
        "title":"HTML5中的autofocus（自动聚焦）属性介绍",
        "tips":"HTML",
        "detail":"HTML5给我们带来了一大堆神奇的东西。以前需要用JavaScript和Flash完成的任务，例如表单校验，INPUT placeholders , 客户端重命名下载文件和音频/视频，这些都可以使用基本的HTML完成......谷歌公司的研究人员聆听了119个小时用户对移动网站的抱怨，了解到构建移动网站的精髓。 最近，来自谷歌公司和AnswerLab的研究人员主持了一场长达119小时的用户测试会议，他们每天都会让用户访问100个不同的移动网站，这些网站涉及的行业范围非常广泛，最近博客的多说评论总是抽风，先来吐槽一下。 刚在整理评论的时候吓我一跳，之前我的好多评论都没了，是的，是只有我自己的评论没有了，而其它人的评论还有。",
        "date":"2016-02-31",
        "link":"###"
    },
    {
        "title":"CSS实现背景图尺寸不随浏览器缩放而变化的两种方法",
        "tips":"CSS",
        "detail":"一些网站的首页背景图尺寸不随浏览器缩放而变化，本例使用CSS 实现背景图尺寸不随浏览器缩放而变化，方法一. 把图片作为background，方法二使用img标签。喜欢的朋友可以看看......",
        "date":"2016-08-31",
        "link":"###"
    },
    {
        "title":"input file上传文件样式支持Html5的浏览器解决方案",
        "tips":"JavaScript",
        "detail":"最近在使用file上传控件，发现了file上传控件的两个兼容性问题:一个是file上传控件在火狐下无法通过css改变width，另一个是file上传控件在不同的浏览器下的外观和行为都不一样,本文将提供详细的解决方案......",
        "date":"2016-05-31",
        "link":"###"
    },
]*/